---
title: "Облачное хранилище Clodo"
description: "Облачное хранилище Clodo"
layout: article
category: Облачное хранилище
---

В облаке Clodo действует облачное хранилище, предназначенное для хранения статической информации. Оно может использоваться как для быстрого распространения статического контента сайтов (в том числе — высоконагруженных), так и для хранения приватных или корпоративных данных

Хранилище подключено к каналу с пропускной способностью 10 Гбит/сек в дата-центре KIAEHOUSE на территории научного центра «Курчатовский институт».



* Содержание
{:toc}



Основные сведения
-----------------

Облачное хранилище Clodo состоит из двух основных сущностей — само хранилище («бэкенд») и часть, ответственная за кэширование и быструю раздачу «горячего» контента («фронтенд»).

Бэкенд построен с использованием технологии OpenStack Swift. Ее подробное описание находится на официальной [странице проекта](http://swift.openstack.org/). Самой крупной единицей хранения информации является хранилище. Каждый клиент Clodo может создать неограниченное количество хранилищ. Доступ к каждому хранилищу осуществляется по одному ключу, который можно получить в панели управления Clodo при создании нового хранилища. Этот ключ следует использовать для доступа посредством API или клиента (мы рекомендуем Cloudfuse для Linux, Cyberduck последней версии для Windows и Mac OS X).



Управление хранилищем
---------------------

Управление хранилищами доступно во вкладке «Cloud Storage» панели управления

Хранилище   это совокупность логина, ключа и набора контейнеров. В каждом хранилище можно создавать неограченное количество контейнеров. Фактически, контейнер - это папка первого уровня. Он может быть публичным (доступным без авторизации по ключу, в том числе   доступным для раздачи через http) или непубличным (доступным только с авторизацией по ключу).

Управление файлами и контейнерами в хранилище можно осуществлять несколькими способами:

* посредством API;
* посредством клиентов;
* посредством веб-интерфейса панели Clodo.

API подробно описан на странице OpenStack Swift. Благодаря широкой распространенности этого API, существует множество его реализаций — на [PHP](https://github.com/ClodoCorp/php-cloudfiles), [Python](https://github.com/rackspace/python-cloudfiles/tree), [Ruby](https://github.com/rackspace/ruby-cloudfiles/tree), [Java](https://github.com/rackspace/java-cloudfiles/tree) и [C#/.NET](https://github.com/rackspace/csharp-cloudfiles/tree).

Клиенты позволяют управлять хранилищем как посредством графического интерфейса, так и посредством командной строки. Для Windows мы рекомендуем использовать последнюю версию [CloudBerry Explorer](http://www.cloudberrylab.com/free-openstack-storage-explorer.aspx), для Mac OS X [Cyberduck](http://cyberduck.ch/), для Linux — [Cloudfuse](https://github.com/redbo/cloudfuse).

Прежде чем пользоваться клиентами или API, необходимо в панели управления Cloud Storage создать хотя бы одно хранилище и получить логин и ключ для авторизации. При создании каждого хранилища в нем создается два контейнера — публичный «public» и непубличный «private»

Файловый менеджер в веб-интерфейсе панели Clodo позволяет добавлять, удалять и переименовывать файлы, директории и контейнеры, а также менять статус контейнеров с публичных на непубличные и наоборот. Для большинства рутинных операций вполне достаточно использовать веб-интерфейс.



Использование хранилища для распространения контента
----------------------------------------------------

Фронтенд, ответственный за распространение контента, построен на nginx. Он сделан с использованием нескольких кэширующих серверов с большим количеством оперативной памяти, что обеспечивает быструю раздачу «горячего» контента. Использование нескольких независимых фронтендов позволяет добиться высокой скорости отдачи и отказоустойчивости. В настройках публичных контейнеров вы можете указать домен для доступа к ним без авторизации либо использовать предлагаемый системой автоматически генерируемый URL. Для распространения доступны контейнеры, отмеченные как публичные.



Цены
----

Цена использования хранилища складывается из двух составляющих — цены хранения и цены распространения контента. Цена хранения составляет 1 копейку за хранение 1 гигабайта данных в течение 1 часа. Цена распространения (исходящего трафика) составляет 1 рубль за 1 Гб трафика. Входящий трафик на хранилище бесплатен.

Плата за хранение взимается ежечасно по максимальному пространству, занимаемому в хранилище в течение часа с округлением до целого количества гигабайт. Плата за трафик взимается по накоплении целого гигабайта исходящего трафика без округления.

